Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: What happens in between is up to the tag you’re using.
ja: その間に記述した内容が、あたなが使うタグになります。

source: What it’s For
ja: 目的

source: What should the URI look like?
ja: URI がどのように見えるか？

source: What the entries’ URLs should look like
ja: エントリの URL をどのように表示するか

source: What types of entries should be available in the section, and which fields each of those entry types should have
ja: セクション内でどのような入力タイプが利用可能か、それらの入力タイプはどのようなフィールドを持つ必要があるか

source: Whatever works for your site’s needs.
ja: サイトに必要なものは、何でも機能します。

source: Whatever you attach the field to (entries, assets, users, etc.) will be able to create new tags and create relations to any of the tags within that group.
ja: そのフィールドが付加されたもの（エントリ、アセット、ユーザーなど）は何でも、新しいタグを作成したり、グループに含まれるタグとのリレーションを持つことができます。

source: Whatever you attach the field to will be able to create relations to any of the categories within that group.
ja: そのフィールドが付加されたものは何でも、グループに含まれるすべてのカテゴリとのリレーションを持つことができます。

source: When Craft gets to this tag, it will loop through the element’s children, applying the same template defined between your {% nav %} and {% endnav %} tags to those children.
ja: Craft がこのタグを取得すると、エレメントの子をループし、{% nav %} と {% endnav %} タグの間に定義された同じテンプレートをその子に適用します。

source: When a Craft project is initiated using the `craftcms/craft` Composer project, it will have the following files and directories:
ja: Composer プロジェクトの `craftcms/craft` を使用して Craft プロジェクトを初期化すると、次のファイルおよびディレクトリが含まれます。

source: When a block is collapsed, its title bar will show a preview of its content, so you can still identify which block it is.
ja: ブロックが折りたたまれている場合、タイトルバーはコンテンツのプレビューを表示するため、それがどんなブロックかを識別できます。

source: When a request comes in to Craft, it checks to determine where to route the request.
ja: Craft にリクエストが届くと、リクエストの送り先を決定するためにチェックします。

source: When a request comes in, Craft checks this file first, and then the routes defined in Settings → Routes.
ja: リクエストが届くと、Craft は初めにこのファイルをチェックし、次に「設定 > ルート」に定義されたルートをチェックします。

source: When a user forgets their password, Craft will send them an email with a URL to set a new password.
ja: ユーザーがパスワードを忘れたとき、Craft は新しいパスワードを設定するための URL をメールで送信します。

source: When an update is available, users with the permission to update Craft will see a badge in the CP next to the Utilities navigation item in the sidebar.
ja: アップデートが可能になると、Craft のアップデート権限を持つユーザーは CP のサイドバーにあるナビゲーション項目「ユーティリティ」の横にバッジを確認できるようになります。

source: When assigning a template to a route
ja: テンプレートをルートに割り当てるとき

source: When choosing which template entry and category URLs should load
ja: エントリやカテゴリで読み込む、テンプレートの URL を選択するとき

source: When eager-loading nested sets of elements, you can apply parameters at any level of the eager-loading path.
ja: エレメントのネストされたセットで eager-loading する場合、eager-loading パスの任意のレベルでパラメータを適用することができます。

source: When editing a field layout, you will find a “Content” tab at the top, and a list of all of your site’s fields, grouped into their field groups, at the bottom.
ja: フィールドレイアウトを編集すると、一番上に「コンテンツ」タブが、下段にフィールドグループごとに分類されたすべてのサイトのフィールドのリストが表示されます。

source: When enabled, Craft will create the new entry in each site enabled for that section using the submitted content.
ja: 有効にすると、Craft は送信されたコンテンツを使用して、そのセクションで有効になっているそれぞれのサイトに新しいエントリを作成します。

source: When one of those formats are used, the date will be formatted into a localized date format using <craft\i18n\Formatter::asDate()>.
ja: これらのフォーマットが使用されると、日付は <craft\i18n\Formatter::asDate()> でローカライズされた日付の書式にフォーマットされます。

source: When one of those formats are used, the date will be formatted into a localized date format using craft\i18n\Formatter::asDate().
ja: これらのフォーマットが使用されると、日付は craft\i18n\Formatter::asDate() でローカライズされた日付の書式にフォーマットされます。

source: When the assets aren’t eager-loaded, entry.assetsField gives you an element query that is preconfigured to return the related assets.
ja: アセットを eager-loaded していない 場合、entry.assetsField は関連付けられたアセットを返すよう事前設定された エレメントクエリ を提供します。

source: When the resulting elements must have been created
ja: 結果となるエレメントが作成されていなければならないとき

source: When the resulting elements must have been last updated
ja: 結果となるエレメントが最後に更新されていなければならないとき

source: When to use {% cache %} tags
ja: どんなときに {% cache %} タグを使うのか

source: When upgrading to Craft 3, Craft will automatically create a new asset volume called “User Photos” at storage/userphotos/ (where Craft previously stored all user photos, but without the / subfolders).
ja: Craft 3 にアップグレードすると、Craft は（ / サブフォルダを除く、Craft が事前にすべてのユーザー画像を格納している） storage/userphotos/ を「User Photos」と呼ばれる新しいアセットボリュームとして自動的に作成します。

source: When upgrading to Craft 3, Craft will automatically create a new asset volume called “User Photos”, set to the storage/userphotos/ folder, where Craft previously stored all user photos.
ja: Craft 3 にアップグレードすると、Craft は「User Photos」と呼ばれる新しいアセットボリュームを作成し、過去にアップロードされたファイルを storage/userphotos/ フォルダにセットします。

source: When we disagree, try to understand why. Disagreements, both social and technical, happen all the time and Craft is no exception.
ja: 意見が食い違うときは、なぜそうなのか理解しようと試みてください。 社会であれ技術であれ意見の相違はいつも起きていて、Craft も例外ではありません。

source: When you apply permissions to a user group, all users that belong to that group will inherit them.
ja: ユーザーグループに権限を適用すると、そのグループに所属するすべてのユーザーがそれを継承します。

source: When you click on one of those buttons, a new block will be created.
ja: それらのボタンの1つをクリックすると、新しいブロックが作成されます。

source: When you create a category, you have the following options:
ja: カテゴリを作成するときのオプションは、次の通りです。

source: When you do this, each of the elements returned will have a searchScore attribute set, which reveals what their search score was.
ja: この場合、返されるすべてのエレメントに searchScore 属性がセットされ、それぞれの検索スコアを知ることができます。

source: When you do, a new “Title Format” setting will appear, where you can define what the auto-generated titles should look like.
ja: その際、新たに「タイトル形式」欄が表示され、自動生成されるタイトルの見え方を定義できます。

source: When you download a fresh copy of Craft 3, your project will have the following files and directories:
ja: Craft 3 の新しいコピーをダウンロードすると、プロジェクトには次のファイルやディレクトリがあります。

source: When you edit a user group or a user account, you will find a new Sites permissions section, which lists all of your sites.
ja: ユーザーグループやユーザーアカウントを編集するとき、すべてのサイトのリストに新しいサイトの「権利」セクションが表示されます。

source: When you have at least one asset volume, Craft will add a new Assets item to the Control Panel's main navigation.
ja: 少なくとも1つのアセットボリュームがあれば、Craft はコントロールパネルのメインナビゲーションに「アセット」項目を追加します。

source: When you need to loop over an element query, you should start explicitly calling .all(), which will execute the database query and return the array of results:
ja: エレメントクエリをループする必要があるときは、明示的に .all() をコールし、データベースクエリを実行して得られる結果の配列を返す必要があります。

source: When you need to to get the total number of results from an element query, you should call the .count() method:
ja: エレメントクエリから結果の総数を取得したいときは、.count() メソッドを呼び出す必要があります。

source: When you point your browser to http://example.com/news/archive/2017, it will match your new route, and Craft will load the specified template.
ja: ブラウザが http://example.com/news/archive/2017 を指し示すとき、新しいルートがマッチし、Craft は指定されたテンプレートを読み込みます。

source: When you select a nested category, all of the ancestors leading up to that category will also automatically be selected.
ja: ネストされたカテゴリを選択すると、そのカテゴリに至るすべての先祖カテゴリも自動的に選択されます。

source: Whenever there are files within your asset volume that were not added directly by Craft (e.g. via FTP), you will need to tell Craft to go and look for them.
ja: Craft が直接追加しなかったファイル（例えば、FTP 経由など）がアセットボリュームに含まれる場合、それらを探し出せるよう Craft に教える必要があります。

source: Whenever you’re pulling in data from another site
ja: 他のサイトからデータを取得しているときはいつでも

source: Whether element structure data should automatically be left-joined into the query
ja: クエリ内のエレメントの構造データが自動的に LEFT JOIN されるべきかどうか

source: Whether entries in the section have URLs
ja: セクション内のエントリが URL を持つかどうか

source: Whether or not you wish to make your plugin available as a Composer dependency (you probably should), your plugin must have a composer.json file.
ja: プラグインで Composer 依存を利用可能（おそらくそうすべきです）にしたいかどうかに関わらず、composer.json ファイルを持たなければなりません。

source: Whether results should be returned in the order specified by id
ja: 結果を id で指定された並び順で返すかどうか

source: Whether the elements must be enabled for the chosen site
ja: 選択したサイトでエレメントが利用可能かどうか

source: Whether the query should search the subfolders of folderId
ja: クエリが folderId のサブフォルダを検索するかどうか

source: Whether to only return categories that the user has permission to edit
ja: ユーザーが編集権限を持つカテゴリだけを返すかどうか

source: Whether to only return entries that the user has permission to edit
ja: ユーザーが編集権限を持つエントリだけを返すかどうか

source: Whether to only return the client user
ja: クライアントのユーザーだけを返すかどうか

source: Whether to only return users that are admins
ja: 管理者であるユーザーだけを返すかどうか

source: Whether to return each element as an array
ja: それぞれのエレメントを配列として返すかどうか

source: Whether to return only archived elements
ja: アーカイブされたエレメントだけを返すかどうか

source: Which fields categories in the group should have
ja: グループ内のカテゴリがどんなフィールドを持つべきか

source: Which means in the above code example, totalEntries will be set to the total Article entries, as the type parameter will still be applied.
ja: つまり、上記のサンプルコードでは type パラメータが適用されてしまうため、totalEntries には Article エントリの総数がセットされます。

source: Which means you will need to explicitly set it to true in config/general.php if you’ve configured your server to route HTTP requests to index.php.
ja: HTTP リクエストを index.php にルーティングするようにサーバーを設定した場合、config/general.php で明示的に true にする必要があることを意味しています。

source: Which sites are enabled by default for new entries
ja: 新しいエントリ向けに、どのサイトをデフォルトで有効にするか

source: Which sites entries in the section should target
ja: セクション内のどのサイトのエントリをターゲットにするか

source: Which template should get loaded if an entry’s URL is requested
ja: エントリの URL がリクエストされたとき、どのテンプレートを読み込むか

source: Which template should get loaded?
ja: どのテンプレートを読み込むか？

source: Which template should load if a category’s URL is accessed
ja: カテゴリ URL にアクセスされたとき、どのテンプレートを読み込むか

source: While getting familiar with Craft’s Control Panel, refer to the Core Concepts section for material on Sections & Entries and Fields.
ja: Craft のコントロールパネルに慣れる間に、コアコンセプトであるセクションとエントリやフィールドについて資料を参照してください。

source: While getting familiar with the Craft control panel, refer to the Core Concepts section for material on Sections & Entries, Fields, and Templates.
ja: Craft のコントロールパネルに慣れる間に、コアコンセプトであるセクションとエントリ、フィールド、テンプレートについて資料を参照してください。

source: Widget Types
ja: ウィジェットタイプ

source: Width – The width for this column specified in either pixels or a percentage
ja: 幅 – ピクセルまたはパーセントで指定された、この列の幅

source: Width – the transform’s resulting width
ja: 幅 – 変換結果の幅

source: Windows and macOS
ja: Windows と macOS

source: With Craft 3 downloaded and prepped, follow these steps to complete the upgrade:
ja: Craft 3 をダウンロードして準備したら、次のステップに従ってアップグレードを完了します。

source: With that Entry URI Format, a top-level entry might end up with the URI docs/templating, whereas a nested entry might end up with the URI docs/templating/tags.
ja: このエントリー URI 形式では、トップレベルエントリは URI docs/templating で終わるかもしれないのに対して、ネスとされているエントリの URI docs/templating/tags で終わるかもしれません。

source: With that checked, you will also have the ability to choose a default user group to which Craft will assign the publicly-registered users.
ja: チェックすると、Craft が一般登録したユーザーを割り当てるデフォルトのユーザーグループを選択できるようになります。

source: With that, challenges will arise that can lead to communication issues and unhappiness.
ja: しかし、それは同時にコミュニケーションの問題や不幸を生じさせることがあるでしょう。

source: With the above Entry URI Format, a top-level entry’s URI might end up as docs/templating, whereas a nested entry’s URI might end up as docs/templating/tags.
ja: 上記のエントリー URI 形式では、トップレベルエントリの URI は docs/templating で終わるかもしれないのに対して、ネストされているエントリの URI は docs/templating/tags で終わるかもしれません。

source: With the above Entry URI Format, a top-level entry’s URI might end up as templating, whereas a nested entry’s URI might end up as templating/tags.
ja: 上記のエントリー URI 形式では、トップレベルエントリの URI は templating で終わるかもしれないのに対して、ネストされているエントリの URI は templating/tags で終わるかもしれません。

source: With those in place, you could begin your asset volumes’ Base URL and File System Path settings with them, e.g. @assetBaseUrl/user-photos and @assetBasePath/user-photos.
ja: これらを利用して、アセットボリュームのベース URL やファイルシステムのパス設定を記入しはじめることができます。例：@assetBaseUrl/user-photos と @assetBasePath/user-photos

source: Within `{% include %}`, `{% extends %}`, and `{% embed %}` template tags
ja: `{% include %}`、`{% extends %}`、および `{% embed %}` テンプレートタグ内

source: Within that template, place the following code:
ja: そのテンプレートに、次のコードを記述します。

source: Yii’s translation messages
ja: Yii 向けの翻訳メッセージ

source: You add additional sites using the Sites settings in Settings → Sites.
ja: サイトを追加するには、「設定 > サイト」を使用します。

source: You also have the option of creating a new category while assigning the Parent.
ja: 親を割り当てる際に新しいカテゴリを作成するオプションもあります。

source: You can access all of the sites in the same group as the current site via currentSite.group.sites:
ja: 現在のサイトと同じグループのすべてのサイトは、currentSite.group.sites 経由でアクセスすることができます。

source: You can access the current site's group information using:
ja: 現在のサイトグループの情報には、次のようにアクセスできます。

source: You can access your Global Sets from any template via their handles.
ja: 任意のテンプレートからハンドル経由でグローバル設定にアクセスできます。

source: You can add First Page and Last Page links into the mix, you can do that too:
ja: 最初のページと最後のページのリンクをミックスすることもできます。

source: You can add as many blocks to your Matrix field as you’d like (or at least as many as the field’s Max Blocks setting will allow).
ja: あなたは好きなだけ（または、最大ブロック数の設定で許可されている範囲内で）、行列フィールドへブロックを追加できます。

source: You can add parameters to the ElementCriteriaModel object as well:
ja: ElementCriteriaModel オブジェクトにパラメータを追加することもできます。

source: You can also add additional fields using all of the available field types in Craft.
ja: Craft 内で利用可能なすべてのフィールドタイプを使って、フィールドを追加することもできます。

source: You can also add any additional parameters supported by the element type:
ja: エレメントタイプでサポートされている追加パラメータを付加することもできます。

source: You can also batch-set parameters like so:
ja: 次のように、パラメータを一括設定することもできます。

source: You can also choose to not pass any number in at all, in which case all previous/next page URLs will be returned.
ja: いずれの数値も渡さないよう選択することもできます。その場合、すべての 前 / 次のページ URL が返されます。

source: You can also create drafts of entries that live alongside the current live version of the entry.
ja: エントリの現在の公開バージョンと並行して、エントリのドラフトを作成することもできます。

source: You can also define transforms directly in your templates.
ja: テンプレート内で直接トランスフォームを定義することもできます。

source: You can also drag selected fields around to change their order.
ja: 選択されたフィールドをドラッグして、順番を入れ替えることもできます。

source: You can also manually clear all of your template caches from the Settings page, using the “Clear Caches” tool.
ja: 「キャッシュをクリア」ツールを使用して、「設定」ページからすべてのテンプレートキャッシュを手動でクリアすることもできます。

source: You can also set the order parameter to 'score' if you want results ordered by best-match to worst-match:
ja: 検索結果をベストマッチからワーストマッチの順に並び替えたい場合、order パラメータに 'score' をセットすることもできます。

source: You can also set the orderBy parameter to 'score' if you want results ordered by best-match to worst-match:
ja: 検索結果をベストマッチからワーストマッチの順に並び替えたい場合、orderBy パラメータに 'score' をセットすることもできます。

source: You can also take advantage of Craft’s static translation support for strings throughout your templates.
ja: テンプレート全体の文字列に Craft の静的翻訳サポートを利用することもできます。

source: You can also tell if a particular option is selected outside the scope of looping through the options like so:
ja: オプションのループのスコープ外でも、次のように特定のオプションが選択されているかを知ることができます。

source: You can also use a regular expression to search for matches by starting and ending the replacement string’s value with forward slashes:
ja: 置換文字列の値の最初と最後にスラッシュを付けてマッチするものを検索することで、正規表現も利用できます。

source: You can also use the Updates widget on the Control Panel dashboard, which is installed by default.
ja: デフォルトでインストールされているコントロールパネルのダッシュボードにあるアップデートウィジェットを利用することもできます。

source: You can alter the default behavior of search terms with the defaultSearchTermOptions config setting.
ja: コンフィグ設定の defaultSearchTermOptions で、検索語のデフォルトの振る舞いを変更することができます。

source: You can apply these permissions directly to user accounts as well as to user groups.
ja: これらの権限はユーザーアカウントと同様にユーザーグループにも直接適用できます。

source: You can assign your own variables using the set tag:
ja: set タグを利用して、独自の変数を割り当てることができます。

source: You can change that by overriding the limit parameter.
ja: 変更するには limit パラメータで上書きします。

source: You can change the Primary site once you create additional sites.
ja: 追加のサイトを作成すると、プライマリサイトを変更できます。

source: You can collapse Matrix blocks by clicking the “Collapse” menu option, or by double-clicking on a block’s title bar.
ja: メニューオプションの「折りたたむ」 をクリックするか、ブロックのタイトルバーをダブルクリックすることで、行列ブロックを折りたたむことができます。

source: You can configure Craft to use an alternative cache storage by overriding the cache application component from config/app.php.
ja: config/app.php で cache アプリケーションコンポーネントを上書きすることによって代替のキャッシュストレージを使うよう Craft を設定できます。

source: You can create a Forgot Password form using the following code:
ja: 次のコードを利用して、パスワードを忘れた際のフォームを作成できます。

source: You can create a new entry form for the front-end of your site using the following code:
ja: 次のコードを利用して、サイトのフロントエンド向けに新しいエントリの投稿フォームを作成できます。

source: You can create as many content tabs as you want, and use them to organize similar fields together.
ja: 必要数のコンテンツタブを作成し、類似するフィールドをまとめて分類するために利用します。

source: You can create element queries in both PHP and Twig code.
ja: PHP と Twig 両方のコードで、エレメントクエリを作成できます。

source: You can create folksonomies for your entries, users, and assets using Tags.
ja: タグを利用して、エントリ、ユーザー、およびアセットの分類を作成できます。

source: You can create taxonomies for your entries, users, and assets using Categories.
ja: カテゴリを利用して、エントリ、ユーザー、およびアセットの分類を作成できます。

source: You can customize Craft’s entire application configuration from config/app.php.
ja: config/app.php から、Craft のすべてのアプリケーション設定をカスタマイズできます。

source: You can customize the config settings Guzzle uses when sending these requests by creating a guzzle.php file in your config/ folder.
ja: config/ フォルダに guzzle.php ファイルを作成することによって、これらのリクエストを送信する際に Guzzle が使用するコンフィグ設定をカスタマイズできます。

source: You can customize which status code accompanies your redirect response by typing it right after the URL.
ja: リダイレクトのレスポンスに伴うステータスコードは、URL の直後に入力することでカスタマイズできます。

source: You can customize your site’s 404 page by placing a 404.html template at the root of your craft/templates/ directory.
ja: craft/templates/ ディレクトリのルートにある 404.html テンプレートで、サイトの 404 ページをカスタマイズできます。

source: You can customize your site’s 404 page by placing a 404.html template at the root of your templates/ directory.
ja: templates/ ディレクトリのルートにある 404.html テンプレートで、サイトの 404 ページをカスタマイズできます。

source: You can define additional custom aliases using the config setting.
ja: コンフィグ設定を利用して、追加の独自エイリアスを定義することができます。

source: You can define additional custom aliases using the aliases config setting.
ja: aliases コンフィグ設定を利用して、追加の独自エイリアスを定義することができます。

source: You can define custom URL rules in config/routes.php, which will get merged in with any routes you’ve defined on the Settings → Routes page in the Control Panel.
ja: config/routes.php にコントロールパネルの「設定 > ルート」ページで定義したすべてのルートとマージされる、独自の URL ルール を定義できます。

source: You can define custom criteria parameters that will get applied as elements are being eager-loaded, by replacing its key with an array that has two values: the key, and an object that defines the criteria parameters that should be applied.
ja: そのキーを（キー、および適用されるべき基準パラメータを定義するオブジェクトを含む）2つの値を持つ配列に置き換えることによって、eager-loaded するときにエレメントへ適用されるカスタムの基準パラメータを定義できます。

source: You can define one or more sites at different domains, using a different set of templates, and different versions of entry content.
ja: ドメインが異なったり、異なるテンプレートセットを使用したり、エントリコンテンツの異なるバージョンを持っている、1つ以上のサイトを定義できます。

source: You can define transforms from the Control Panel by going to Settings → Assets → Image Transforms and clicking the “New Transform” button.
ja: 「設定 > アセット > 画像の変形」に移動し、「新しい画像変換」ボタンをクリックすることで、コントロールパネルからトランスフォームを定義することができます。

source: You can do that from the “Update Asset Indexes” tool within Settings.
ja: 設定内の「アセットインデックスの更新」ツールから、それを行うことができます。

source: You can easily add comments to your Craft entry pages by utilizing a third-party comment service such as Disqus.
ja: Disqus のようなサードパーティのコメントサービスを利用して、Craft のエントリページに簡単にコメント機能を追加することができます。

source: You can edit an asset volume’s field layout by clicking on the Field Layout tab when editing the volume.
ja: ボリュームの編集中に、フィールドレイアウトタブをクリックすることでアセットボリュームのフィールドレイアウトを編集できます。

source: You can edit the Handle if you'd like.
ja: あなたが望むなら、ハンドルを編集できます。

source: You can either edit the file manually, or run the ./craft setup command from the root project directory in your terminal.
ja: マニュアルでファイルを編集するか、ターミナル上のプロジェクトルートのディレクトリから ./craft setup コマンドを実行できます。

source: You can either edit the file manually, or run the ./craft setup command from your new root project directory in your terminal.
ja: 手動でファイルを編集するか、ターミナルの新しいプロジェクトルートディレクトリから ./craft setup コマンドを実行します。

source: You can either give it a full URL, or just the path.
ja: 完全な URL を与えることも、パスだけ指定することもできます。

source: You can either run that from your terminal or your web browser.
ja: ターミナル または ウェブブラウザ から実行できます。

source: You can find a full specification for defining URL rules and routes at the Yii documentation.
ja: URL ルールとルートを定義するための完全な仕様は、Yii documentation を参照してください。

source: You can find out your installed version of Composer (if any) by opening your terminal running the following command:
ja: 起動しているターミナル上で次のコマンドを実行することによって、（もし存在するのであれば）インストール済みの Composer のバージョンを確認できます。

source: You can find out your installed version of Composer by running composer -V from your terminal.
ja: 起動しているターミナル上で composer -V を実行することによって、インストールされている Composer のバージョンを確認できます。

source: You can generate and assign the key manually, or have Craft do it for you with a terminal command.
ja: 手動でキーの生成と割り当てを行うか、ターミナルコマンドで Craft に任せることもできます。

source: You can get the total number of blocks using the length filter:
ja: length フィルタを利用して、ブロックの総数を取得できます。

source: You can give your group a Name and Handle, plus any permissions you want every user within the group to have.
ja: グループには、名前とハンドルに加え、グループに含まれるすべてのユーザーに与える権限をセットすることができます。

source: You can leave comments for future self in the code using comment tags.
ja: コメントタグを利用して、コード内に将来の自分に向けたコメントを残すことができます。

source: You can loop through your selected options like so:
ja: 選択されたオプションを次のようにループすることができます。

source: You can manage your sections’ Entry Types by clicking the “Edit Entry Types” link beside the section’s name in Settings → Sections.
ja: 「設定 > セクション」のセクション名の横にある「入力タイプを変更してください。」リンクをクリックして、セクションの入力タイプを管理できます。

source: You can manipulate variables with filters.
ja: フィルタで変数を操作できます。

source: You can modify the form to save existing entries by adding an “entryId” hidden input to the form:
ja: 不可視項目の「entryId」を追加すると、既存のエントリを保存するためのフォームに変更できます。

source: You can optionally pass false to it if you want group symbols to be omitted (e.g. commas in English).
ja: グループシンボル（例えば、英語のコンマ）を省略したい場合は、オプションで false を渡すことができます。

source: You can optionally pass in the maximum distance away from the current page the function should go.
ja: 現在のページから到達可能な最大距離をオプションとして渡すことができます。

source: You can optionally set the HTTP status code that should be included with the response.
ja: レスポンスに含まれるべき HTTP ステータスコードをオプションでセットできます。

source: You can output an option’s label by typing {{ option.label }} instead, and you can tell if the option is selected or not via option.selected.
ja: いずれの場合も、オプションのラベルを出力するには {{ option.label }} と記述します。オプションが選択されているかどうかは option.selected で知ることができます。

source: You can output the selected option’s label like so:
ja: 選択されたオプションのラベルを次のように出力できます。

source: You can output the selected option’s value like so:
ja: 選択されたオプションの値を次のように出力できます。

source: You can override that within your login form using a redirect param:
ja: redirect パラメータを利用して、ログインフォーム内で設定を上書きすることもできます。
